{
  "//": "Folder that will be opened by default when displaying the 'open file' dialog",
    "defaultOpenFileLocation": "C:\\Program Files (x86)\\Steam\\steamapps\\common\\Awesomenauts\\Modding\\OwnMods",
  "//" : "name of the block to create followed by the block type it can be attached to. Use an empty array for no blocks. First one is the default one for some actions and must be connectable to root",
    "connectionsTypes": [
      {"name": "normal", "linkableTo": ["condition", "root", "other", "logic"], "sortOrder": 1},
      {"name": "else", "linkableTo": ["condition", "logic"], "sortOrder": 2},
      {"name": "or", "linkableTo":  ["logic"], "sortOrder": 0, "allowedChildTypes": ["condition"], "childrenAreTerminalNodes": 1}
    ],
  "//" : "The name of the block that will be added by default when creating a new file, leave empty for none",
    "defaultBlock": "root",
  "//" : "Name of the tag used for values definitions",
    "predefinedValuesTagName": "predefined_values",
  "//": "Adds encapsulating blocks to top levels blocks. Array index = recursive depth. Check an Awesomenauts AI to see why this is done",
    "topLevelBlocksContainer": ["enemy", "behaviour"],
  "//" : "Used when loading a block to set a default value when it's not specified in the definition. You can add custom ones. If missing, empty string is set a default",
    "defaultEmptyValues": {
      "float": 0,
      "number": 0,
      "int": 0,
      "short": 0,
      "long": 0,
      "double": 0.0,
      "bool": 0,
      "boolean": 0,
      "string": "",
      "text": "",
      "char": ""
    },
  "//": "The character used to separate values saved using a checkbox",
    "multiSelectSeparator": ";;",
  "//": "This allows to automatically add an attribute with a custom name that will be used for comments. Leave empty for none",
    "commentAttributeName": "Comment",
  "//": "This allows saving children collapsed status. Leave empty if you don't want to save this",
    "minimizedAttributeName": "Minimized"
}
